Repository: TaoK/PoorMansTSqlFormatter
Catalog: PoorMansTSqlFormatterCmdLine/GeneralLanguageContent.*.resx
Languages: es, fr

# UnrecognizedArgumentsErrorMessage
source: Unrecognized arguments found!
es: Hemos encontrado argumentos no reconocidos!
fr: Paramètres inconnus trouvés!

# BackupFailureWarningMessage
source: Failed to back up file: {0}{1} Skipping formatting for this file.
es: Copia de seguridad fallada: {0}{1} Saltando este archivo.
fr: Sauvegarde échouée: {0}{1} On saute la mise en forme pour ce fichier.

# ContentWriteFailureWarningMessage
source: Failed to write reformatted contents: {0}
es: Error al escribir el archivo formateado: {0}
fr: L'écriture du contenu mis en forme a échoué: {0}

# ErrorDetailMessageFragment
source: Error detail: {0}
es: Detalle del error: {0}
fr: Détail de l'erreur: {0}

# FileReadFailureWarningMessage
source: Failed to read file contents (aborted): {0}
es: Error al abrir el archivo (abandonando): {0}
fr: La lecture du contenu du fichier a échoué (abandonné): {0}

# FolderCreationFailureWarningMessage
source: Failed to create target folder: {0}
es: Error al crear la carpeta: {0}
fr: La création du dossier a échoué: {0}

# NoFilesFoundWarningMessage
source: No files found matching filename/pattern ({0}) and extension ({1})
es: Ningun archivo se encontró con este nombre o patrón ({0}) y extensión ({1})
fr: Aucun fichier trouvé pour ce nom ou modèle de nom ({0}) et extension ({1})

# OutputFileCreationErrorMessage
source: The requested output file could not be created. Error detail: {0}
es: El archivo de destino indicado no se pudo crear. Detalle del error: {0}
fr: Le fichier de destination n'a pas pu se créer. Détail de l'erreur: {0}

# ParseErrorWarningPrefix
source: --WARNING! ERRORS ENCOUNTERED DURING SQL PARSING!
es: --ALERTA! SE ENCONTRARON ERRORES AL ANALIZAR EL CODIGO SQL!
fr: --ATTENTION! DES ERREURS ON ÉTÉS DÉTECTÉES PENDANT L'ANALYSE DU CODE SQL!

# ParsingErrorWarningMessage
source: Encountered error when parsing or formatting file contents (aborted): {0}
es: Se encontró un error analizando los contenidos del archivo (abandonado): {0}
fr: Une erreur s'est produite pendant l'analyse ou la mise en forme des contenus de ce fichier (abandonné): {0}

# PathPatternErrorMessage
source: Error processing requested filename/pattern. Error detail: {0}
es: Se encontró un error procesando este nombre de archivo o patrón. Detalle del error: {0}
fr: Une erreur s'est produite pendant le traitement du nom de fichier ou modèle. Détail de l'erreur: {0}

# PossiblePartialWriteWarningMessage
source: NOTE: this file may have been overwritten with partial content!
es: AVISO: es posible que este archivo haya sido sobrescrito con contenidos partiales!
fr: AVIS: il se peut que se fichier ait été écrasé par des contenus partiels!

# ProgramSummary
source: Poor Man's T-SQL Formatter - a small free Transact-SQL formatting library for .Net 2.0, written in C#. Distributed under AGPL v3. Copyright (C) 2011 Tao Klerks
es: Poor Man's T-SQL Formatter - una biblioteca pequeña y gratuita para el formateado de T-SQL (Transact-SQL) para .Net 2.0, escrita en C#. Distribuida bajo licencia AGPL v3. Copyright (C) 2011 Tao Klerks
fr: Poor Man's T-SQL Formatter - une petite bibliothèque gratuite de formattage de T-SQL (Transact-SQL) pour .Net 2.0, écrite en C#. Distribuée sous AGPL v3. Copyright (C) 2011 Tao Klerks

# ProgramUsageNotes
source: Usage notes: SqlFormatter <filename or pattern> <options> is indentString (default: \t) st spacesPerTab (default: 4) mw maxLineWidth (default: 999) sb statementBreaks (default: 2) cb clauseBreaks (default: 1) tc trailingCommas (default: false) sac spaceAfterExpandedComma (default: false) ebc expandBetweenConditions (default: true) ebe expandBooleanExpressions (default: true) ecs expandCaseStatements (default: true) ecl expandCommaLists (default: true) eil expandInLists (default: true) uk uppercaseKeywords (default: true) sk standardizeKeywords (default: false) ae allowParsingErrors (default: false) e extensions (default: sql) r recursive (default: false) b backups (default: true) o outputFileOrFolder (default: none; if set, overrides the backup option) l languageCode (default: current if supported or EN; valid values include EN, FR and ES) h ? help Disable boolean options with a trailing minus, enable by just specifying them or with a trailing plus. You can also pipe the SQL to be formatted in (UTF-8 encoding), and then no input path is expected. Examples: SqlFormatter TestFiles\* /is:" " /tc /uk- SqlFormatter test*.sql /o:resultfile.sql echo select somecolumn from sometable | SqlFormatter
es: Notas de uso: SqlFormatter <archivo or patrón> <opciones> is indentString (predeterminado: \t) st spacesPerTab (predeterminado: 4) mw maxLineWidth (predeterminado: 999) sb statementBreaks (predeterminado: 2) cb clauseBreaks (predeterminado: 1) tc trailingCommas (predeterminado: falso) sac spaceAfterExpandedComma (predeterminado: falso) ebc expandBetweenConditions (predeterminado: verdadero) ebe expandBooleanExpressions (predeterminado: verdadero) ecs expandCaseStatements (predeterminado: verdadero) ecl expandCommaLists (predeterminado: verdadero) ecl expandInLists (predeterminado: verdadero) bjo breakJoinOnSections (predeterminado: falso) uk uppercaseKeywords (predeterminado: verdadero) sk standardizeKeywords (predeterminado: falso) ae allowParsingErrors (predeterminado: falso) e extensions (predeterminado: sql) r recursive (predeterminado: falso) b backups (predeterminado: verdadero) o outputFileOrFolder (predeterminado: ninguno; si se incluye, anula la option "backups") l languageCode (predeterminado: idioma actual si es soportado; optiones soportadas incluyen EN, FR y ES) h ? help Se pueden desactivar opciones booleanas siguendolas de un "menos", o activarlas con solo incluirlas o siguendolas de un "mas". Se puede proporcionar el codigo SQL por tubería (pipe) en vez de proporcionar un nombre de archivo, pero tiene que ser codificado con UTF-8. Exemplos: SqlFormatter TestFiles\* /is:" " /tc /uk- SqlFormatter test*.sql /o:resultfile.sql echo select algunacolumna from algunatabla | SqlFormatter
fr: Notes d'usage: SqlFormatter <nom de fichier ou modèle> <options> is indentString (par défaut: \t) st spacesPerTab (par défaut: 4) mw maxLineWidth (par défaut: 999) sb statementBreaks (par défaut: 2) cb clauseBreaks (par défaut: 1) tc trailingCommas (par défaut: faux) sac spaceAfterExpandedComma (par défaut: faux) ebc expandBetweenConditions (par défaut: vrai) ebe expandBooleanExpressions (par défaut: vrai) ecs expandCaseStatements (par défaut: vrai) ecl expandCommaLists (par défaut: vrai) eil expandInLists (par défaut: vrai) bjo breakJoinOnSections (par défaut: faux) uk uppercaseKeywords (par défaut: vrai) sk standardizeKeywords (par défaut: faux) ae allowParsingErrors (par défaut: faux) e extensions (par défaut: sql) r recursive (par défaut: faux) b backups (par défaut: vrai) o outputFileOrFolder (par défaut: aucun; s'il est spécifié, overrides the backup option) l languageCode (par défaut: langue actuelle si elle est supportée; valeurs valables sont EN, FR et ES) h ? help On peut désactiver les options booléennes en les suivant d'un "moins", et les activer simplement en les spécifiant, ou aussi en les suivant d'un "plus". Vous pouvez aussi utilizer un Tube (/tuyeau/pipe) pour proportionner le SQL d'entree (en codage UTF-8), et alors aucun nom de fichier est attenu. Par exemple: SqlFormatter TestFiles\* /is:" " /tc /uk- SqlFormatter test*.sql /o:resultfile.sql echo select unecolonnequelconque from untableauquelconque | SqlFormatter

# UnrecognizedLanguageErrorMessage
source: The provided Language Code is not supported.
es: No se reconoció el codigo de idioma proporcionado.
fr: Le code de langue fourni n'est pas valable.

# NoInputErrorMessage
source: No input (filename(s) or piped input) has been provided.
es: Ningun archivo de entrada (o tubería/pipe) ha sido proporcionado.
fr: Aucun fichier d'entrée (ou tube/pipe) n'a été proportionné.
