Repository: TaoK/PoorMansTSqlFormatter
Catalog: PoorMansTSqlFormatterDemo/MainForm.*.resx
Languages: es

# englishToolStripMenuItem.Text
source: English
es: Inglés

# frenchToolStripMenuItem.Text
source: French
es: Francés

# spanishToolStripMenuItem.Text
source: Spanish
es: Español

# $this.Text
source: SQL Formatter
es: Formateador de SQL

# aboutToolStripMenuItem.Text
source: About
es: Acerca de

# chk_BreakJoinOnSections.Text
source: Break Join ON Sections
es: Salto en Secciones ON

# chk_Coloring.Text
source: Enable Coloring
es: Activar Coloreado

# chk_EnableKeywordStandardization.Text
source: Enable Keyword Standardization
es: Activar Estandarización de Palabras Clave

# chk_ExpandBetweenConditions.Text
source: Expand BETWEEN Conditions
es: Expandir Condiciones BETWEEN

# chk_ExpandBooleanExpressions.Text
source: Expand Boolean Expressions
es: Expandir Expresiones Booleanas

# chk_ExpandCaseStatements.Text
source: Expand CASE Statements
es: Expandir Declaraciones CASE

# chk_ExpandCommaLists.Text
source: Expand Comma Lists
es: Expandir Listas de Comma

# chk_IdentityColoring.Text
source: Enable Coloring
es: Activar Coloreado

# chk_SpaceAfterComma.Text
source: Space After Comma
es: Espacio Después de Coma

# chk_TrailingCommas.Text
source: Trailing Commas
es: Comas Traseras

# chk_UppercaseKeywords.Text
source: Uppercase Keywords
es: Palabras Clave en Mayúsculas

# displayFormattingOptionsAreaToolStripMenuItem.Text
source: Display Formatting Options Area
es: Mostrar Opciones de Formatteado

# displayParsedSqlToolStripMenuItem.Text
source: Display Parsed SQL (Xml) Area
es: Mostrar Zona de SQL Par (Xml)

# displayTokenListToolStripMenuItem.Text
source: Display Token List Area
es: Mostrar Zona del Listado de Elementos

# groupBox1.Text
source: Input SQL
es: SQL de Entrada

# groupBox2.Text
source: Token List
es: Listado de Elementos

# groupBox3.Text
source: Parse Tree
es: Árbol de Análisis Sintactico

# groupBox4.Text
source: Output SQL
es: SQL de Salida

# groupBox5.Text
source: Formatting Options
es: Opciones de Formateado

# grp_IdentityFormattingOptions.Text
source: Identity Formatting Options
es: Opciones de Formateado Preservado

# grp_Options.Text
source: Standard Formatting Options
es: Opciones de Formateado Estándar

# languageToolStripMenuItem.Text
source: Language
es: Idioma

# lbl_Indent.Text
source: Indent:
es: Texto de Indentación:

# lbl_IndentWidth.Text
source: Indent Width:
es: Ancho de Indentación:

# lbl_MaxWidth.Text
source: Max Width:
es: Ancho Máximo:

# optionsToolStripMenuItem.Text
source: Options
es: Opciones

# radio_Formatting_Identity.Text
source: Identity (mirroring) Formatting
es: Formateado Preservado

# radio_Formatting_Standard.Text
source: Standard Formatting
es: Formateado Estándar

# radio_Formatting_Obfuscate.Text
source: Obfuscation / Minification
es: Ofuscación / Minificación

# grp_ObfuscationOptions.Text
source: Obfuscation Options
es: Opciones de Ofuscación
